using SQLite;
using TAKTORProject.Models;
namespace TAKTORProject;

public partial class initializeStoreData : ContentPage
{
	private SQLiteAsyncConnection conn;
	public initializeStoreData()
	{
		InitializeComponent();

        string dbPath = Path.Combine(Environment.GetFolderPath(Environment.SpecialFolder.LocalApplicationData), "Taktor.db3");
        conn = new SQLiteAsyncConnection(dbPath);
        conn.CreateTableAsync<Product>().Wait();

        List<Product> AddProducts = new List<Product>()
        {
            new Product()
            {
                Id = 1,
                Name = "ผ้าไหมหมี่ขิด ลายก้นหอย",
                Province = "อุดรธานี",
                Price = 2700,
                Description = "มาจากแหล่งอารยธรรม มรดกโลกบ้านเชียง ที่เป็นอัตลักษณ์โดดเด่นของจังหวัดอุดรธานี “ลายก้นหอย” นำจากเครื่องปั้นดินเผา สร้างลายบนผืนผ้าแสดงถึงเรื่องราวของมรดกภูมิปัญญา วิถีชีวิต ความเชื่อ ความเจริญรุ่งเรืองด้วยศิลปวัฒนธรรม และความสามัคคีของคนในชุมชน ที่บอกเล่าเรื่องราวของคนโบราณ ผสมผสานด้วยลายผ้าขิดของคนโบราณและคนอีสาน ภายใต้ผลงานชื่อ “ผ้าไหมหมี่ขิด ลายก้นหอย อารยธรรมห้าพันปี",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/072%20%E0%B8%AD%E0%B8%B8%E0%B8%94%E0%B8%A3%E0%B8%98%E0%B8%B2%E0%B8%99%E0%B8%B5-078.jpg")
            },
             new Product()
            {
                Id = 2,
                Name = "ผ้ามัดหมี่ ลายดอกฝ้ายเมืองเลย",
                Province = "เลย",
                Price = 3000,
                Description = "การสร้างสรรค์ลายผ้าใหม่ ความร่วมสมัยแต่ยังคงความเป็นเอกลักษณ์ สะท้อนถึงวิถีวัฒนธรรมของชาวจัง หวัดเลย แสดงให้เห็นถึงเรื่อราวของวิถีชีวิตของชาวเมืองเลย ได้เป็นอย่างดี สะท้อนถึง ภาพในอดีตของจังหวัดเลย ที่เคยเป็นแหล่งปลูกฝ้ายที่ใหญ่ที่สุดในประเทศ เป็นแหล่งผลิิตฝ้ายคุณภาพดี เป็นที่รู้จักอย่างแพร่หลายในนาม “ผ้าฝ้ายเมืองเลย”",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/050%20%E0%B9%80%E0%B8%A5%E0%B8%A2-024.jpg")
            },
              new Product()
            {
                Id = 3,
                Name = "ผ้ามัดหมี่ ลายดอกดาวเรือง",
                Province = "สมุทธปราการ",
                Price = 4500,
                Description = "มีความสวยงามแฝงด้วยความเรียบง่าย สามารถนำไปออกแบบเพื่อใช้ประโยชน์ได้ง่าย เช่น นำไปออกแบบตัดเสื้อได้ทั้งผู้หญิงและผู้ชาย",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/040%20%E0%B8%AA%E0%B8%A1%E0%B8%B8%E0%B8%97%E0%B8%A3%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3-014.jpg")
            },
               new Product()
            {
                Id = 4,
                Name = "ผ้ามัดหมี่โฮล",
                Province = "สุรินทร์",
                Price = 2500,
                Description = "ผ้าโฮล มีพัฒนาการมาจากผ้าปูม เป้นผ้าที่ใช้กันในหมู่ชนชั้นสูงในราชสำนัก มีความวิจิตร งดงาม ปัจจุบันได้มีการประยุกต์ใช้เพื่อให้ประชาชนทั่วไปสามารถสวมใส่ได้ โดยไม่ทิ้งภูมิปัญญาดั้งเดิมของบรรพบุรุษ และได้รับการขึ้นทะเบียนเป็นมรดกภูมิปัญญาทางวัฒนธรรม ในปี 2562",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/068%20%E0%B8%AA%E0%B8%B8%E0%B8%A3%E0%B8%B4%E0%B8%99%E0%B8%97%E0%B8%A3%E0%B9%8C-124.jpg")
            },
               new Product()
            {
                Id = 5,
                Name = "ผ้ายกตานี",
                Province = "ปัตตานี",
                Price = 6000,
                Description = "ผ้าพื้นเมืองดั้งเดิมแบบหนึ่งของปัตตานี และจังหวัดภาคใต้ตอนล่าง ลักษณะที่เป็นเอกลักษณ์คือมีล่องหรือลวดลายตามชายผ้า หรือที่ริมผ้า บางครั้งจึงเรียกว่า \"ผ้าล่องจวน\" ช่างทอผ้าชาวเมืองปัตตานีรุ่นเก่า ๆ เรียกผ้าดังกล่าวว่า \"จูวา\" จูวา หมายถึงลวดลายที่ปรากฏอยู่บริเวณชายผ้าทั้งสองด้าน",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/025%20%E0%B8%9B%E0%B8%B1%E0%B8%95%E0%B8%95%E0%B8%B2%E0%B8%99%E0%B8%B5-019.jpg")
            },
               new Product()
            {
                Id = 6,
                Name = "ผ้าจก ลายดอกประดู่ศรีอุตรดิตถ์",
                Province = "อุตรดิตถ์",
                Price = 4000,
                Description = "ลายผ้าเอกลักษณ์จังหวัดอุตรดิตถ์ ลาย “ดอกประดู่ศรีอุตรดิตถ์” เป็นลายผ้าที่ผสมผสานสามวัฒนธรรม ( ล้านนา- ล้านช้าง-ไทย ) แสดงให้เห็นถึงภูมิปัญญา วิถีชีวิต วัฒนธรรม ประเพณีของชาวอุตรดิตถ์",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/073%20%E0%B8%AD%E0%B8%B8%E0%B8%95%E0%B8%A3%E0%B8%94%E0%B8%B4%E0%B8%95%E0%B8%96%E0%B9%8C-053.jpg")
            },
               new Product()
            {
                Id = 7,
                Name = "ผ้าจก ลายดอกประดู่ศรีอุตรดิตถ์",
                Province = "ราชบุรี",
                Price = 2800,
                Description = "วิธีทอผ้าลาย “ราชาบุรี” หรือ ลาย “กาบโอ่งนกคู่” จะมีความละเอียดซับซ้อน เริ่มตั้งแต่การเตรียมเส้นยืนไว้บนหูก สอดเส้นยืนใส่ช่องฟันหวี เก็บตะกอ และเตรียมเส้นด้ายพิเศษสําหรับจก ผู้ทอผ้าจะใช้ขนเม่นจก (ควัก) เส้นยืนยกขึ้น แล้วใช้ปลายแหลมของขนเม่นเกี่ยวเส้นด้ายเสริมสําหรับจกให้สอดไปอยู่ข้างใต้เส้นยืนที่ยกขึ้น ดึงปลายเส้นจกดังกล่าวมาไว้ข้างบนของผ้า เมื่อจกลายในแถวเสร็จจึงเหยียบม้าไม้ของหูกดึงตะกอแยกเส้นยืนให้ขึ้นลงห่างจากกัน พุ่งกระสวยนําเส้นพุ่งให้อยู่ระหว่างเส้นยืนบนและล่างเกิดเป็นเนื้อผ้าลายขัดอัดเส้นจกให้แน่นอยู่กับที่สลับกันไปจนครบลายตามที่ต้องการ",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/035%20%E0%B8%A3%E0%B8%B2%E0%B8%8A%E0%B8%9A%E0%B8%B8%E0%B8%A3%E0%B8%B5-106.jpg")
            },
               new Product()
            {
                Id = 8,
                Name = "ผ้าทอเกาะยอ ลายราชวัตร",
                Province = "อุตรดิตถ์",
                Price = 3000,
                Description = "ลายผ้าเอกลักษณ์จังหวัดอุตรดิตถ์ ลาย “ดอกประดู่ศรีอุตรดิตถ์” เป็นลายผ้าที่ผสมผสานสามวัฒนธรรม ( ล้านนา- ล้านช้าง-ไทย ) แสดงให้เห็นถึงภูมิปัญญา วิถีชีวิต วัฒนธรรม ประเพณีของชาวอุตรดิตถ์",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/039%20%E0%B8%AA%E0%B8%87%E0%B8%82%E0%B8%A5%E0%B8%B2-019.jpg")
            },
               new Product()
            {
                Id = 9,
                Name = "ผ้าขิด ลายฟงส์ในโคม",
                Province = "เชียงใหม่",
                Price = 4500,
                Description = "ลายหงส์ในโคม มีที่มาจากลายผ้าทอโบราณที่โดดเด่น และแพร่หลายในกลุ่มชาติพันธุ์ไทยวนหรือคนเมืองในเชียงใหม่มาแต่อดีต ซึ่งบ่งบอกถึงวิถีชีวต ศิลปะ ประเพณีและวัฒนธรรมอันดีงามของจังหวัดเชียงใหม่ที่สืบถอดกันมาจากอดีตจนถึงปัจจุบัน",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/048%20%E0%B9%80%E0%B8%8A%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88-055.jpg")
            },
               new Product()
            {
                Id = 10,
                Name = "ผ้ายกลายราชวัตรโคม",
                Province = "สุราษฎร์ธานี",
                Price = 2600,
                Description = "ผ้ายกลายราชวัตรโคมมีลักษณะโครงสร้างรวมอยู่ในรูปตารางสี่เหลี่ยมแนวตะแคง ทำนองเดียวกับรั้วราชวัตรสำหรับกำหนดขอบเขตมณฑลพิธี จึงสื่อถึงความหมายมงคลเปรียบประดุจรั้วราชวัตร นำมาซึ่งคุณงามความดี สิริมงคล และช่วยปกปักรักษาผู้สวมใส่",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/067%20%E0%B8%AA%E0%B8%B8%E0%B8%A3%E0%B8%B2%E0%B8%A9%E0%B8%8E%E0%B8%A3%E0%B9%8C%E0%B8%98%E0%B8%B2%E0%B8%99%E0%B8%B5-137.jpg")
            },
               new Product()
            {
                Id = 11,
                Name = "ผ้าไหมแพรวาลายนาค 12 แขน",
                Province = "กาฬสินธุ์",
                Price = 7000,
                Description = "ผ้าไหมแพรวาลายนาค 12 แขน เป็นอีกลายหนึ่งของผ้าไหมแพรวาจังหวัดกาฬสินธุ์ คือลายนาค 12 แขน นาค ถือเป็นสัตว์ที่เป็นมงคล ตามความเชื่อของคนภาคอีสานลุ่มน้ำโขงนาค 12 แขน หมายถึง ความเป็นสิริมงคล ตามราศี 12 ราศี หมายรวมถึง สิริมงคลหนึ่งปี มี 12 เดือน หรือความเป็นมงคลตามฮีต 12 ของคนอีสาน",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/010%20%E0%B8%81%E0%B8%B2%E0%B8%AC%E0%B8%AA%E0%B8%B4%E0%B8%99%E0%B8%98%E0%B8%B8%E0%B9%8C-020.jpg")
            },
               new Product()
            {
                Id = 12,
                Name = "ผ้าลายตาจัก",
                Province = "กาญจนบุรี",
                Price = 1000,
                Description = "ผ้าลายตาจัก เป็นผ้าที่มีลวดลายเป็นเอกลักษณ์แปลกตา การทอจะพลิกแพลงลวดลายของการจักสานมาประยุกต์ใช้ในการทอผ้า มีสีสันสดใส หลากหลายสี และสีสดสวยไม่ตก แต่เดิมนั้นวัสดุที่ใช้ จะใช้ฝ้ายนำมาย้อมสีธรรมชาติ เช่น สีเหลืองย้อมด้วยขมิ้นกับปูน สีแดงย้อมด้วยเปลือกประดู่ สีดำย้อมด้วยมะเกลือ สีเขียวย้อมด้วยใบแคตำ เป็นต้น แต่ปัจจุบันด้วยความทันสมัยทางเทคโนโลยี จึงได้เปลี่ยนวัสดุที่ใช้มาเป็นหาซื้อฝ้ายที่ย้อมสีแล้วตามท้องตลาด เพราะจะได้ฝ้ายที่สีสดใส และสีไม่ตก",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/009%20%E0%B8%81%E0%B8%B2%E0%B8%8D%E0%B8%88%E0%B8%99%E0%B8%9A%E0%B8%B8%E0%B8%A3%E0%B8%B5-014.jpg")
            },
                new Product()
            {
                Id = 13,
                Name = "ผ้าทอยกดอก",
                Province = "พัทลุง",
                Price = 3000,
                Description = "จากความผูกพันของชาวบ้านป่าพะยอมกับต้นพะยอมและดอกพะยอมที่มีมานาน และเพื่อให้แสดงถึง สัญลักษณ์ของอำเภอป่าพะยอมและของจังทวัดพัทลุง จึงใช้ชื่อดอกพะยอมมาตั้งเป็นชื่อลายผ้าที่แสดงถึง เอกลักษณ์ของจังหวัดพัทลุง",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/005%20%E0%B8%9E%E0%B8%B1%E0%B8%97%E0%B8%A5%E0%B8%B8%E0%B8%87-007.jpg")
            },
                new Product()
            {
                Id = 14,
                Name = "ผ้าซิ่นเก็บลายก้ามปู",
                Province = "สระบุรี",
                Price = 4000,
                Description = "การทอผ้าจกลายก้ามปูนี้ มีมาตั้งแต่ ๒๕๐ ปี ด้วยความศรัทธาในพระพุทธศาสนา ช่างทอในสมัยนั้น ได้ถอดแบบมาจากลายปูนปั้นประดับเจดีย์เป็นพุทธบูชาที่เชื่อว่าเป็นสิริมงคลแก่ผู้นุ่งห่ม และเชื่อกันว่าผ้าทอลายก้ามปูเป็นเครื่องนุ่งห่มของชาวไทยวนที่เป็นชนชั้นสูงในสมัยนั้น",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-10/043%20%E0%B8%AA%E0%B8%A3%E0%B8%B0%E0%B8%9A%E0%B8%B8%E0%B8%A3%E0%B8%B5-108%202.jpg")
            },
                 new Product()
            {
                Id = 15,
                Name = "ผ้าทอลายช่อใบมะขาม",
                Province = "ชัยนาท",
                Price = 3500,
                Description = "จุดเด่นของผ้าทอลายช่อใบมะขาม คือ จะต้องคงลักษณะตามธรรมชาติให้มากที่สุด ลวดลายใบย่อยต้องมีรูปทรงรีเล็ก โคนใบมน และก้านใบต้องมีใบย่อย 7 คู่ เหมือนใบมะขามตามธรรมชาติ ถักทอด้วยช่างทอที่มีความประณีตและชำนาญโดยเน้นการใช้สี 5 สี ได้แก่ สีเขียว แดง ส้ม เหลือง และขาว ซึ่งเป็นสีมงคลตามความเชื่อของชาวลาวเวียง ที่จะทำให้ผู้ที่สวมใส่ผ้าทอลายช่อใบมะขามมีความน่าเกรงขาม มีความสุข ความเจริญรุ่งเรือง",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/053%20%E0%B8%8A%E0%B8%B1%E0%B8%A2%E0%B8%99%E0%B8%B2%E0%B8%97-093.jpg")
            },
                  new Product()
            {
                Id = 16,
                Name = "ผ้าขิดสลับหมี่ ลายดอกบัวหลวง",
                Province = "หนองบัวลำภู",
                Price = 2500,
                Description = "ผ้าขิดสลับหมี่ ลายดอกบัวหลวงเป็นดอกบัวบานและบัวตูม” ซึ่งเป็นดอกไม้ประจำจังหวัด และสื่อถึงคำขวัญประจำจังหวัดหนองบัวลำภู นครเขื่อนขันธ์กาบแก้วบัวบาน คำขวัญประจำจังหวัด ลวดลายดอกบัวหลวง คือดอกไม้ประจำจังหวัดหนองบัวลำภู สื่อถึง สีชมพู คือโทนสีประจำจังหวัดหนองบัวลำภู ฉะนั้นเมื่อรวมทุกสิ่งเข้าด้วยกัน จึงรังสรรค์ออกมาเป็นผ้าทอที่มีอัตลักษณ์ของจังหวัดหนองบัวลำภูอยู่อย่างครบถ้วน",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/070%20%E0%B8%AB%E0%B8%99%E0%B8%AD%E0%B8%87%E0%B8%9A%E0%B8%B1%E0%B8%A7%E0%B8%A5%E0%B8%B3%E0%B8%A0%E0%B8%B9-096.jpg")
            },
                    new Product()
            {
                Id = 17,
                Name = "ผ้าลายสะเก็ดธรรมง",
                Province = "สกลนคร",
                Price = 4000,
                Description = "ผ้า “ลายสะเก็ดธรรม”เป็นผ้าฝ้ายทอมือย้อมสีธรรมชาติ โดยอาศัยวัสดุธรรมชาติต่าง ๆเช่น เปลือกไม้ ใบไม้และพืชต่าง ๆ ที่มีอยู่ในท้องถิ่น กลายเป็นผลิตภัณฑ์ผ้าทอมือที่สวยงาม และได้รับความนิยมเป็นอย่างสูง สามารถระบายความร้อนได้ดี และไม่เกิดสารพิษต่อร่างกายเมื่อถูกแสงแดด เนื้อผ้ามีความเบา นุ่มนวล มีน้ำหนักทั้งตัว ความสวยงามความประณีตของผ้าทอมือยังสอดแทรกด้วยภูมิปัญญาของบรรพบุรุษ โดยมีการมัดหมี่แล้วนำไปย้อมสีธรรมชาติเพื่อให้เกิดลวดลาย\r\n บนผืนผ้า โดยผสมผสานเทคนิคการทอผ้าแบบพื้นบ้าน",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/038%20%E0%B8%AA%E0%B8%81%E0%B8%A5%E0%B8%99%E0%B8%84%E0%B8%A3-091.jpg")
            },
                    new Product()
            {
                Id = 18,
                Name = "ผ้ายกเมืองนคร ลายดอกพิกุล",
                Province = "นครศรีธรรมราช",
                Price = 3500,
                Description = "ลักษณะพิเศษของผ้ายกเมืองนครศรีธรรมราช อันเลื่องลือ มาจากลวดลายที่มีความละเอียด โดยเฉพาะลายที่เชิง โดยเชิงผ้าจะไม่เหมือนกับภาคอื่น มีลักษณะที่เป็นวิธีของช่างทอที่แกะดอกผูกลายเฉพาะตัวโดยมีตะกอเขาลอยยกดอกแยกเส้นยืนต่างหาก ทําให้สามารถยกครั้งละกี่เส้นก็ได้ การสร้างลายจึงทําได้สวยงามเป็นพิเศษ",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/03%20%E0%B8%99%E0%B8%84%E0%B8%A3%E0%B8%A8%E0%B8%A3%E0%B8%B5%E0%B8%98%E0%B8%A3%E0%B8%A3%E0%B8%A1%E0%B8%A3%E0%B8%B2%E0%B8%8A-013.jpg")
            },
                    new Product()
            {
                Id = 19,
                Name = "ผ้ากาบบัว",
                Province = "อุบลราชธานี",
                Price = 3400,
                Description = "ผ้ากาบบัว เป็นชื่อผ้าในวรรณกรรมโบราณอีสาน มีความหมายเหมาะสมสอดคล้องกับชื่อของจังหวัดอุบลราชธานี เมื่อดูความหมายของ \"กาบ\" ตามพจนานุกรมฯ อธิบายไว้ว่า \"น.เปลือกหุ้มชั้นนอกของผลหรือดอก และของต้นไม้บางชนิด ลอกออกได้เป็นชั้นๆ เช่น กาบมะพร้าว กาบหมาก กาบกล้วย โดยปริยายหมายถึง สิ่งที่มีลักษณะเช่นนั้น\" โดยนัยแห่งคำอธิบายตามพจนานุกรมนี้ \"กาบบัว\" จึงหมายถึง เปลือกหุ้มชั้นนอกของดอกบัว มิใช่กลีบบัวที่หุ้มรอบเกสรบัวที่อยู่ชั้นใน ดังนั้น กาบบัว คือ กลีบบัวชั้นนอกสุดที่แก่จัดเกือบร่วงโรย",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/075%20%E0%B8%AD%E0%B8%B8%E0%B8%9A%E0%B8%A5%E0%B8%A3%E0%B8%B2%E0%B8%8A%E0%B8%98%E0%B8%B2%E0%B8%99%E0%B8%B5-034.jpg")
            },
                     new Product()
            {
                Id = 20,
                Name = "ผ้าไหมหางกระรอก",
                Province = "นครราชสีมา",
                Price = 7500,
                Description = "จังหวัดนครราชสีมา มีชื่อเสียงด้านผ้าไหม คือผ้าไหมหางกระรอก เป็นผ้าพื้นที่มีความสวยงามจากสีเหลืองของไหม เส้นไหมสองเส้นสองสีมาตีเกลียวควบให้เป็นเส้นเดียวกัน เรียกว่า “เส้นหางกระรอก” จะได้ผ้าพื้นที่มีลายเหลือบเล็กๆ ในเนื้อผ้าดูคล้ายจะมีปุยขนอ่อนขึ้นมาเหมือนกับเส้นขนของหางกระรอก จึงเรียกว่า“ผ้าหางกระรอก”",
                Image = new Uri("https://www.thaifabricwisdom.com/sites/default/files/2022-08/018%20%E0%B8%99%E0%B8%84%E0%B8%A3%E0%B8%A3%E0%B8%B2%E0%B8%8A%E0%B8%AA%E0%B8%B5%E0%B8%A1%E0%B8%B2-011.jpg")
            },
        };

        foreach (Product product in AddProducts)
        {
            conn.InsertAsync(product);
        }
        
    }
}